<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;
use App\Models\Customer;

class Rpg23Controller extends Controller
{
    public function rpg23(Request $request)
    {
        $countys = [
            '高雄市' => [
                '新興區' => '800', '前金區' => '801', '苓雅區' => '802', '鹽埕區' => '803', '鼓山區' => '804', '旗津區' => '805',
                '前鎮區' => '806', '三民區' => '807', '楠梓區' => '811', '小港區' => '812', '左營區' => '813',
                '仁武區' => '814', '大社區' => '815', '東沙群島' => '817', '南沙群島' => '819', '岡山區' => '820', '路竹區' => '821',
                '阿蓮區' => '822', '田寮區' => '823',
                '燕巢區' => '824', '橋頭區' => '825', '梓官區' => '826', '彌陀區' => '827', '永安區' => '828', '湖內區' => '829',
                '鳳山區' => '830', '大寮區' => '831', '林園區' => '832', '鳥松區' => '833', '大樹區' => '840', '旗山區' => '842',
                '美濃區' => '843', '六龜區' => '844', '內門區' => '845', '杉林區' => '846', '甲仙區' => '847', '桃源區' => '848',
                '那瑪夏區' => '849', '茂林區' => '851', '茄萣區' => '852'
            ],
            '屏東縣' => [
                '屏東市' => '900', '三地門鄉' => '901', '霧臺鄉' => '902', '瑪家鄉' => '903', '九如鄉' => '904', '里港鄉' => '905',
                '高樹鄉' => '906', '鹽埔鄉' => '907', '長治鄉' => '908', '麟洛鄉' => '909', '竹田鄉' => '911', '內埔鄉' => '912',
                '萬丹鄉' => '913', '潮州鎮' => '920', '泰武鄉' => '921', '來義鄉' => '922', '萬巒鄉' => '923', '崁頂鄉' => '924',
                '新埤鄉' => '925', '南州鄉' => '926', '林邊鄉' => '927', '東港鎮' => '928', '琉球鄉' => '929', '佳冬鄉' => '931',
                '新園鄉' => '932', '枋寮鄉' => '940', '枋山鄉' => '941', '春日鄉' => '942', '獅子鄉' => '943', '車城鄉' => '944',
                '牡丹鄉' => '945', '恆春鎮' => '946', '滿州鄉' => '947'
            ],
            '臺南市' => [
                '中西區' => '700', '東區' => '701', '南區' => '702', '北區' => '704', '安平區' => '708', '安南區' => '709',
                '永康區' => '710', '歸仁區' => '711', '新化區' => '712', '左鎮區' => '713', '玉井區' => '714', '楠西區' => '715',
                '南化區' => '716', '仁德區' => '717', '關廟區' => '718', '龍崎區' => '719', '官田區' => '720', '麻豆區' => '721',
                '佳里區' => '722', '西港區' => '723', '七股區' => '724', '將軍區' => '725', '學甲區' => '726', '北門區' => '727',
                '新營區' => '730', '後壁區' => '731', '白河區' => '732', '東山區' => '733', '六甲區' => '734', '下營區' => '735',
                '柳營區' => '736', '鹽水區' => '737', '善化區' => '741', '大內區' => '742', '山上區' => '743', '新市區' => '744',
                '安定區' => '745'
            ],
        ];

        $datas = [];

        $total_count = 0; // 初始化總數為 0

        foreach($countys as $county_name => $county) {
            foreach($county as $district_name => $district) {
                // 假設使用了模型 Customer 來計算特定區域的客戶數量
                $count = Customer::where('district', 'like', $district_name)->count();
                $datas[$county_name]['districts'][$district_name]['count'] = $count;
                // 將當前區域的客戶數量加到總數中
                $total_count += $count;
            }
        }

        foreach ($datas as $county_name => &$county_data) {
            uasort($county_data['districts'], function ($a, $b) {
                return $b['count'] - $a['count']; // 降序排序
            });
        }
        // dd($datas);
        return view('rpg23.index')->with('datas', $datas)->with('total_count',$total_count);
    }
}
